{
  "_name_or_path": "C:\\Users\\doren\\.cache\\huggingface\\hub\\models--Snowflake--snowflake-arctic-embed-xs\\snapshots\\86a07656cc240af5c7fd07bac2f05baaafd60401",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "Economics, Econometrics and Finance",
    "1": "Materials Science",
    "2": "Environmental Science",
    "3": "Medicine",
    "4": "Psychology",
    "5": "Dentistry",
    "6": "Business, Management and Accounting",
    "7": "Engineering",
    "8": "Biochemistry, Genetics and Molecular Biology",
    "9": "Agricultural and Biological Sciences",
    "10": "Energy",
    "11": "Earth and Planetary Sciences",
    "12": "Health Professions",
    "13": "Chemistry",
    "14": "Chemical Engineering",
    "15": "Social Sciences",
    "16": "Pharmacology, Toxicology and Pharmaceutics",
    "17": "Arts and Humanities",
    "18": "Mathematics",
    "19": "Immunology and Microbiology",
    "20": "Veterinary",
    "21": "Decision Sciences",
    "22": "Nursing",
    "23": "Physics and Astronomy",
    "24": "Neuroscience",
    "25": "Computer Science"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "Agricultural and Biological Sciences": 9,
    "Arts and Humanities": 17,
    "Biochemistry, Genetics and Molecular Biology": 8,
    "Business, Management and Accounting": 6,
    "Chemical Engineering": 14,
    "Chemistry": 13,
    "Computer Science": 25,
    "Decision Sciences": 21,
    "Dentistry": 5,
    "Earth and Planetary Sciences": 11,
    "Economics, Econometrics and Finance": 0,
    "Energy": 10,
    "Engineering": 7,
    "Environmental Science": 2,
    "Health Professions": 12,
    "Immunology and Microbiology": 19,
    "Materials Science": 1,
    "Mathematics": 18,
    "Medicine": 3,
    "Neuroscience": 24,
    "Nursing": 22,
    "Pharmacology, Toxicology and Pharmaceutics": 16,
    "Physics and Astronomy": 23,
    "Psychology": 4,
    "Social Sciences": 15,
    "Veterinary": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.42.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
